app/controllers/candidate_controller.rb

  def index
    render json: Candidate.all
---
SELECT "candidates".* FROM "candidates"

  def show
    render json: Candidate.find_by_id(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 2]]