app/controllers/voter_controller.rb

SELECT  "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    render json: Voter.find_by_id(params[:id])