app/controllers/vote_controller.rb

  def index
    render json: Vote.all
---
SELECT "votes".* FROM "votes"